хорошая статья лежит по адресу
https://flagman.top/about-business/ehkzamen-1s/universalnye-kollekcii-znachenij

Типы универсальных коллекций 1С:

    Массив
    Структура
    Соответствие
    Список значений
    Таблица значений
    Дерево значений
    COMSafeArray
    КлючИЗначение
    ФиксированныйМассив
    ФиксированнаяКоллекция
    ФиксированноеСоответствие
    ФиксированнаяСтруктура

Прикладные коллекции

  ТабличнаяЧасть
  НаборЗаписей регистра
  
Интерфейсные
  
  ДинамическийСписок
  ДанныеФормыКоллекция (https://its.1c.ru/db/v8std/content/628/hdoc)

Теперь подробнее
# Скорость доступа
## Структура

```
ТЗ = Новый ТаблицаЗначений;
стрк = Новый Структура;
фстрк = новый фиксированнаяСтруктура(стрк);

для сч = 1 по 1000 цикл
	стрк.вставить("_"+Формат(сч,"ЧГ="), сч);
конецЦикла;

нач = ТекущаяУниверсальнаяДатаВМиллисекундах();
а = Неопределено;
для сч = 1 по 1000000 цикл
	
	рез = стрк.свойство("_550",а);
	
КонецЦикла;
кон = ТекущаяУниверсальнаяДатаВМиллисекундах();
сообщить(кон-нач);
```
Время = 1300 мс

## Фиксированная структура
код из примера для Структуры
Время - то же

## Соответствие
Код в целом такой же
```
соот = Новый Соответствие;
для сч = 1 по 1000 цикл
	соот.вставить("_"+Формат(сч,"ЧГ="), сч);
конецЦикла;
нач = ТекущаяУниверсальнаяДатаВМиллисекундах();
а = Неопределено;
для сч = 1 по 1000000 цикл
	а = соот.получить("_550");
КонецЦикла;
кон = ТекущаяУниверсальнаяДатаВМиллисекундах();
сообщить(кон-нач);
```
Время = 1400 мс

Вариант с доступом через []
а = соот["_550"];
Время = 1450 мс

## СписокЗначений
НайтиПоИдентификатору()
ТЗ = Новый ТаблицаЗначений;
СЗ = Новый СписокЗначений;

ИД = Неопределено;
для сч = 1 по 1000 цикл
	эл = СЗ.Добавить(сч);
	Если сч = 550 Тогда
	    ИД = эл.getID();
	КонецЕсли;
конецЦикла;

нач = ТекущаяУниверсальнаяДатаВМиллисекундах();
а = Неопределено;
для сч = 1 по 1000000 цикл
	рез = СЗ.НайтиПоИдентификатору(ИД);
КонецЦикла;
кон = ТекущаяУниверсальнаяДатаВМиллисекундах();
сообщить(кон-нач);

Время = 11 600 мс

НайтиПоЗначению()
рез = СЗ.НайтиПоЗначению(550);
Время = 10 000 мс

Получить()
рез = СЗ.Получить(550);
Время = 1300 мс


## ТаблицаЗначений

ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("ключ");
ТЗ.Колонки.Добавить("зн");
//ТЗ.Индексы.Добавить("ключ");

ИД = Неопределено;
для сч = 1 по 1000 цикл
	стрк = ТЗ.Добавить();
	стрк.Ключ = "_"+Формат(сч,"ЧГ=");
	стрк.зн = сч;
конецЦикла;

нач = ТекущаяУниверсальнаяДатаВМиллисекундах();
а = Неопределено;
для сч = 1 по 1000000 цикл
	
	рез = ТЗ.Найти("_550", "Ключ");
	
КонецЦикла;
кон = ТекущаяУниверсальнаяДатаВМиллисекундах();
сообщить(кон-нач);



Найти()
НЕТ индекса по колонке Ключ
Время = 27 000 мс 
ЕСТЬ индекс по колонке Ключ
Время = 2200 мс

НайтиСтроки()
```
ТЗ = Новый ТаблицаЗначений;
ТЗ.Колонки.Добавить("ключ");
ТЗ.Колонки.Добавить("зн");
ТЗ.Индексы.Добавить("ключ");

ИД = Неопределено;
для сч = 1 по 1000 цикл
	стрк = ТЗ.Добавить();
	стрк.Ключ = "_"+Формат(сч,"ЧГ=");
	стрк.зн = сч;
конецЦикла;

Отбор = Новый Структура;
Отбор.Вставить("ключ", 550);
нач = ТекущаяУниверсальнаяДатаВМиллисекундах();
а = Неопределено;
для сч = 1 по 1000000 цикл
	
	рез = ТЗ.НайтиСтроки(Отбор);
	
КонецЦикла;
кон = ТекущаяУниверсальнаяДатаВМиллисекундах();
сообщить(кон-нач);
```
НЕТ индекса по колонке Ключ
Время = 66 000 мс
ЕСТЬ индекс по колонке Ключ
Время = 2300 мс

## Массив
Найти()
```
м = Новый Массив;
для сч = 1 по 1000 цикл
	м.Добавить(сч);
конецЦикла;

нач = ТекущаяУниверсальнаяДатаВМиллисекундах();
для сч = 1 по 1000000 цикл
	рез = м.Найти(550);
КонецЦикла;
кон = ТекущаяУниверсальнаяДатаВМиллисекундах();
сообщить(кон-нач);
```
Время =  11 000 мс
